<?php

return [
    'poker' => [
        'poker' => [
            1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10,11,12,13,
            14,15,16,17,18,19,20,21,22,23,24,25,26,
            27,28,29,30,31,32,33,34,35,36,37,38,39,
            40,41,42,43,44,45,46,47,48,49,50,51,52,100,200
        ], // 原有 所有的扑克牌
        'big_king_num'      => 200,   // 大王数值
        'small_king_num'    => 100, // 小王数值
        'push_poker_num'    => 5,  // 发牌数  发几张牌
        'poker_content'     => [ 1=>'A',2=>2,3=>3,4=>4,5=>5,6=>6,7=>7,8=>8,9=>9,10=>10,11=>'J',12=>'Q',13=>'K',100=>'Queen',200=>'KING'],  // pai 的内容
        'poker_huase'       => [ 0=>'heitao', 1=>'hongtao', 2=>'meihua', 3=>'fangkuai', 4=>'wang'], //0 黑，1红，2梅花，3方，4w   的花色
        'king_hua_val'      => 4, // 王牌的花色
        'poker_icon'          => [ 0=>'♠', 1=>'♥', 2=>'♣', 3=>'♦', 4=> 'Ψ' ], // 花色的图标
        'pair_min_poker'    => 8, // 一对的时候，牌必须是大于或者等于8
    ]
];